app/controllers/business_contexts_controller.rb

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", 9]]
SELECT  "business_contexts".* FROM "business_contexts" WHERE "business_contexts"."request_id" = ? LIMIT 1  [["request_id", 9]]
---
  def show
	@request = Request.find(params[:request_id])
	@bc = @request.business_context
	@headings = @bc.headings.all

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", 9]]
---
	def edit
		@request = Request.find(params[:request_id])

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "business_contexts" SET "as_is_image" = ?, "to_be_image" = ?, "updated_at" = ? WHERE "business_contexts"."id" = ?  [["as_is_image", "test"], ["to_be_image", "test"], ["updated_at", "2016-02-21 19:15:41.708747"], ["id", 1]]
---
	def update
		@request = Request.find(params[:request_id])
		@bc = @request.business_context
		if @request.business_context.update(business_context_params)