app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests"
---
	def index
		@requests = Request.all

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@request = Request.find(params[:id])

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@request = Request.find(params[:id])

INSERT INTO "requests" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "4an"], ["text", "oianwergåoinaewg\r\n"], ["created_at", "2016-02-19 20:10:42.688169"], ["updated_at", "2016-02-19 20:10:42.688169"]]
INSERT INTO "business_contexts" ("description", "request_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Autogenererad description"], ["request_id", 8], ["created_at", "2016-02-21 13:40:40.540813"], ["updated_at", "2016-02-21 13:40:40.540813"]]
---
	def create
		@request = Request.new(request_params)

		if @request.save
			redirect_to @request
			#render 'show'
		else
			@disable_nav = true
			render 'new'
		end
		#Fyll business Context default
		@request.business_context = BusinessContext.create

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "requests" SET "creation_date" = ?, "updated_at" = ? WHERE "requests"."id" = ?  [["creation_date", "2016-02-06"], ["updated_at", "2016-02-22 20:12:31.899276"], ["id", 12]]
---
	def update
		@request = Request.find(params[:id])

		if @request.update(request_params)

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 2]]
---
	def destroy
		request = Request.find(params[:id])
		request.destroy